/* Задача 4: Напишите программу, которая принимает на
вход цифру, обозначающую день недели, и проверяет,
является ли этот день выходным. */

int x = 7;

if (x<6)
{
    System.Console.WriteLine("Нет");
}

else 
{
    System.Console.WriteLine("Да");
}