# Задача 4: Задайте список из N элементов, заполненных числами из промежутка [-N, N]. Найдите произведение элементов на указанных позициях. 
# Позиции хранятся в файле file.txt в одной строке одно число.

def print_numbers(start,end):
    while start <= end:
        print (start)
        start+=1

print_numbers(-5,5)