/* Задача 1: Напишите программу, которая принимает на
вход трёхзначное число и на выходе показывает вторую
цифру этого числа.*/

int x = 456;

System.Console.WriteLine(x%100/10);
